name: "0_transformworkflowtriton"
input {
  name: "user_id"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_shops"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_profile"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_group"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_gender"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_age"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_consumption_2"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_is_occupied"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_geography"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_intentions"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_brands"
  data_type: TYPE_INT32
  dims: -1
}
input {
  name: "user_categories"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_id"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_shops"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_profile"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_group"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_gender"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_age"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_consumption_2"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_is_occupied"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_geography"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_intentions"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_brands"
  data_type: TYPE_INT32
  dims: -1
}
output {
  name: "user_categories"
  data_type: TYPE_INT32
  dims: -1
}
instance_group {
}
parameters {
  key: "cats"
  value {
  }
}
parameters {
  key: "conts"
  value {
  }
}
parameters {
  key: "python_module"
  value {
    string_value: "merlin.systems.triton.models.workflow_model"
  }
}
backend: "python"
